In [1]:
import numpy as numpy
import pandas as pd

In [2]:
pd.Series()

pandas.core.series.Series

In [7]:
country = ['USA','CANADA','MEXICO']
year = ['1999','2001','2002']

In [14]:
ser = pd.Series(year,index=country)
ser

USA       1999
CANADA    2001
MEXICO    2002
dtype: object

In [12]:
type(ser)

pandas.core.series.Series

In [15]:
ser[0]

'1999'

In [16]:
ser['USA']

'1999'

In [18]:
ages = {'sam':4, 'farnk':10, 'jhon':15}

In [19]:
pd.Series(ages)
#keys(sam) = indexs

sam       4
farnk    10
jhon     15
dtype: int64

In [23]:
ages['sam']

4

In [25]:
import pandas as pd
expenses = pd.Series({'Andrew':200,'Bob':150,'Claire':450})

bob_expense = expenses['Bob']
bob_expense

150

In [4]:
import pandas as pd
# Imaginary Sales Data for 1st and 2nd Quarters for Global Company
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [8]:
df_q1 = pd.Series(q1)
df_q2 = pd.Series(q2)

In [10]:
df_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [11]:
df_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [12]:
df_q1['Japan']

80

In [15]:
df_q1['India']

200

In [16]:
df_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [17]:
df_q2.keys()

Index(['Brazil', 'China', 'India', 'USA'], dtype='object')

In [18]:
[1,2,3] * 3

[1, 2, 3, 1, 2, 3, 1, 2, 3]

In [22]:
import numpy as np
np.array([1,2,3]) * 3

array([3, 6, 9])

In [23]:
df_q1 *2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [24]:
df_q1 / 100

Japan    0.8
China    4.5
India    2.0
USA      2.5
dtype: float64

In [25]:
df_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [26]:
df_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [27]:
df_q1 + df_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [29]:
#brazil and japan not there in both series
df_q1.add(df_q2, fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [59]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [34]:
myindex = ["CA", "NY", "AZ","TX"]
mycolumn = ["JAN","FEB","MAR"]

In [38]:
df = pd.DataFrame(mydata, index=myindex, columns=mycolumn)
df

    JAN  FEB  MAR
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [43]:
df.info()
#df["AZ"]["JAN"]

ll Count  Dtype
---  ------  --------------  -----
 0   JAN     4 non-null      int32
 1   FEB     4 non-null      int32
 2   MAR     4 non-null      int32
dtypes: int32(3)
memory usage: 240.0+ bytes

In [44]:
pwd()

'c:\\Users\\saikiran\\Desktop\\py\\Udemy_exapmles'

In [52]:
ls

 Volume in drive C is Windows
 Volume Serial Number is F8E3-60DE

 Directory of c:\Users\saikiran\Desktop\py\Udemy_exapmles

14-12-2020  12:23    <DIR>          .
14-12-2020  12:23    <DIR>          ..
13-12-2020  07:48            31,177 basicsofpy.ipynb
14-12-2020  12:15            83,941 numpy.ipynb
15-12-2020  15:15             3,955 pandas.ipynb
               3 File(s)        119,073 bytes
               2 Dir(s)  254,313,332,736 bytes free

In [162]:
df = pd.read_csv('c:\\Users\\saikiran\\Desktop\\py\\UDEMY_RESOURCES\\03-Pandas\\tips.csv')

In [56]:
df

240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17
243     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [71]:
df.head(4)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tips/size
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.505000
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.553333
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1.166667
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,1.655000

In [72]:
df.tail(3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tips/size
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,1.000
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,0.875
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,1.500

In [84]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID',
       'tips/size'],
      dtype='object')

In [75]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [82]:
df.describe()
#mean std of cc number doesnt make sence as its a alpha numeric number

,total_bill,tip,size,price_per_person,CC Number,tips/size
count,244.000000,244.000000,244.000000,244.000000,2.440000e+02,244.000000
mean,19.785943,2.998279,2.569672,7.888197,2.563496e+15,1.212762
std,8.902412,1.383638,0.951100,2.914234,2.369340e+15,0.491705
min,3.070000,1.000000,1.000000,2.880000,6.040679e+10,0.400000
25%,13.347500,2.000000,2.000000,5.800000,3.040731e+13,0.862500
50%,17.795000,2.900000,2.000000,7.255000,3.525318e+15,1.107500
75%,24.127500,3.562500,3.000000,9.390000,4.553675e+15,1.500000
max,50.810000,10.000000,6.000000,20.270000,6.596454e+15,3.333333

In [87]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15
tips/size,244.0,1.212762e+00,4.917049e-01,4.000000e-01,8.625000e-01,1.107500e+00,1.500000e+00,3.333333e+00

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  tips/size         244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

In [88]:
df

    2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID  tips/size
0    Christy Cunningham  3560325168603410    Sun2959   0.505000
1        Douglas Tucker  4478071379779230    Sun4608   0.553333
2        Travis Walters  6011812112971322    Sun4458   1.166667
3      Nathaniel Harris  4676137647685994    Sun5260   1.655000
4          Tonya Carter  4832732618637221    Sun2251   0.902500
..                  ...               ...        ...        ...
239       Michael Avila  5296068606052842    Sat2657   1.973333
240      Monica Sanders  3506806155565404    Sat1766   1.000000
241          Keith Wong  6011891618747196    Sat3880   1.000000
242        Dennis Dixon     4375220550950      Sat17   0.875000
243     Michelle Hardin  3511451626698139    Thur672   1.500000

[244 rows x 12 columns]

In [92]:
type(df['total_bill'])

pandas.core.series.Series

In [93]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [101]:
mycol = ['total_bill','tip','sex']
df[mycol]

     total_bill   tip     sex
0         16.99  1.01  Female
1         10.34  1.66    Male
2         21.01  3.50    Male
3         23.68  3.31    Male
4         24.59  3.61  Female
..          ...   ...     ...
239       29.03  5.92    Male
240       27.18  2.00  Female
241       22.67  2.00    Male
242       17.82  1.75    Male
243       18.78  3.00  Female

[244 rows x 3 columns]

In [115]:
df[['total_bill','tip','sex']]

     total_bill   tip     sex
0         16.99  1.01  Female
1         10.34  1.66    Male
2         21.01  3.50    Male
3         23.68  3.31    Male
4         24.59  3.61  Female
..          ...   ...     ...
239       29.03  5.92    Male
240       27.18  2.00  Female
241       22.67  2.00    Male
242       17.82  1.75    Male
243       18.78  3.00  Female

[244 rows x 3 columns]

In [122]:
df['tip %'] = df['tip']/df['total_bill'] * 100
df

    2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID      tip %
0    Christy Cunningham  3560325168603410    Sun2959   5.944673
1        Douglas Tucker  4478071379779230    Sun4608  16.054159
2        Travis Walters  6011812112971322    Sun4458  16.658734
3      Nathaniel Harris  4676137647685994    Sun5260  13.978041
4          Tonya Carter  4832732618637221    Sun2251  14.680765
..                  ...               ...        ...        ...
239       Michael Avila  5296068606052842    Sat2657  20.392697
240      Monica Sanders  3506806155565404    Sat1766   7.358352
241          Keith Wong  6011891618747196    Sat3880   8.822232
242        Dennis Dixon     4375220550950      Sat17   9.820426
243     Michelle Hardin  3511451626698139    Thur672  15.974441

[244 rows x 12 columns]

In [123]:
#overwrite the whole columns
df['price_per_person'] = df['total_bill'] / df['size']
df

    2         11.335000
242       17.82  1.75    Male     No   Sat  Dinner     2          8.910000
243       18.78  3.00  Female     No  Thur  Dinner     2          9.390000

             Payer Name         CC Number Payment ID      tip %
0    Christy Cunningham  3560325168603410    Sun2959   5.944673
1        Douglas Tucker  4478071379779230    Sun4608  16.054159
2        Travis Walters  6011812112971322    Sun4458  16.658734
3      Nathaniel Harris  4676137647685994    Sun5260  13.978041
4          Tonya Carter  4832732618637221    Sun2251  14.680765
..                  ...               ...        ...        ...
239       Michael Avila  5296068606052842    Sat2657  20.392697
240      Monica Sanders  3506806155565404    Sat1766   7.358352
241          Keith Wong  6011891618747196    Sat3880   8.822232
242        Dennis Dixon     4375220550950      Sat17   9.820426
243     Michelle Hardin  3511451626698139    Thur672  15.974441

[244 rows x 12 columns]

In [124]:
df['price_per_person'] = np.round(df['total_bill'] / df['size'],2)
df

    2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID      tip %
0    Christy Cunningham  3560325168603410    Sun2959   5.944673
1        Douglas Tucker  4478071379779230    Sun4608  16.054159
2        Travis Walters  6011812112971322    Sun4458  16.658734
3      Nathaniel Harris  4676137647685994    Sun5260  13.978041
4          Tonya Carter  4832732618637221    Sun2251  14.680765
..                  ...               ...        ...        ...
239       Michael Avila  5296068606052842    Sat2657  20.392697
240      Monica Sanders  3506806155565404    Sat1766   7.358352
241          Keith Wong  6011891618747196    Sat3880   8.822232
242        Dennis Dixon     4375220550950      Sat17   9.820426
243     Michelle Hardin  3511451626698139    Thur672  15.974441

[244 rows x 12 columns]

In [127]:
#rmovine column(axis=1) or row(default) not permanent
df.drop('tip %', axis=1)

    2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID      tip %
0    Christy Cunningham  3560325168603410    Sun2959   5.944673
1        Douglas Tucker  4478071379779230    Sun4608  16.054159
2        Travis Walters  6011812112971322    Sun4458  16.658734
3      Nathaniel Harris  4676137647685994    Sun5260  13.978041
4          Tonya Carter  4832732618637221    Sun2251  14.680765
..                  ...               ...        ...        ...
239       Michael Avila  5296068606052842    Sat2657  20.392697
240      Monica Sanders  3506806155565404    Sat1766   7.358352
241          Keith Wong  6011891618747196    Sat3880   8.822232
242        Dennis Dixon     4375220550950      Sat17   9.820426
243     Michelle Hardin  3511451626698139    Thur672  15.974441

[244 rows x 12 columns]

In [128]:
df

    2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID      tip %
0    Christy Cunningham  3560325168603410    Sun2959   5.944673
1        Douglas Tucker  4478071379779230    Sun4608  16.054159
2        Travis Walters  6011812112971322    Sun4458  16.658734
3      Nathaniel Harris  4676137647685994    Sun5260  13.978041
4          Tonya Carter  4832732618637221    Sun2251  14.680765
..                  ...               ...        ...        ...
239       Michael Avila  5296068606052842    Sat2657  20.392697
240      Monica Sanders  3506806155565404    Sat1766   7.358352
241          Keith Wong  6011891618747196    Sat3880   8.822232
242        Dennis Dixon     4375220550950      Sat17   9.820426
243     Michelle Hardin  3511451626698139    Thur672  15.974441

[244 rows x 12 columns]

In [129]:
df = df.drop('tip %', axis=1)

In [130]:
df

240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17
243     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [131]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [165]:
#payment id is unique now payment id is not column dont run it twice
df.set_index("Payment ID")

r     2
Thur672          18.78  3.00  Female     No  Thur  Dinner     2

            price_per_person          Payer Name         CC Number
Payment ID
Sun2959                 8.49  Christy Cunningham  3560325168603410
Sun4608                 3.45      Douglas Tucker  4478071379779230
Sun4458                 7.00      Travis Walters  6011812112971322
Sun5260                11.84    Nathaniel Harris  4676137647685994
Sun2251                 6.15        Tonya Carter  4832732618637221
...                      ...                 ...               ...
Sat2657                 9.68       Michael Avila  5296068606052842
Sat1766                13.59      Monica Sanders  3506806155565404
Sat3880                11.34          Keith Wong  6011891618747196
Sat17                   8.91        Dennis Dixon     4375220550950
Thur672                 9.39     Michelle Hardin  3511451626698139

[244 rows x 10 columns]

In [166]:
#not permanent to make it permanent df = df.reset_index
df.reset_index()

e     No   Sat  Dinner     2
243    243       18.78  3.00  Female     No  Thur  Dinner     2

     price_per_person          Payer Name         CC Number Payment ID
0                8.49  Christy Cunningham  3560325168603410    Sun2959
1                3.45      Douglas Tucker  4478071379779230    Sun4608
2                7.00      Travis Walters  6011812112971322    Sun4458
3               11.84    Nathaniel Harris  4676137647685994    Sun5260
4                6.15        Tonya Carter  4832732618637221    Sun2251
..                ...                 ...               ...        ...
239              9.68       Michael Avila  5296068606052842    Sat2657
240             13.59      Monica Sanders  3506806155565404    Sat1766
241             11.34          Keith Wong  6011891618747196    Sat3880
242              8.91        Dennis Dixon     4375220550950      Sat17
243              9.39     Michelle Hardin  3511451626698139    Thur672

[244 rows x 12 columns]

In [167]:
df = df.set_index("Payment ID")
df

r     2
Thur672          18.78  3.00  Female     No  Thur  Dinner     2

            price_per_person          Payer Name         CC Number
Payment ID
Sun2959                 8.49  Christy Cunningham  3560325168603410
Sun4608                 3.45      Douglas Tucker  4478071379779230
Sun4458                 7.00      Travis Walters  6011812112971322
Sun5260                11.84    Nathaniel Harris  4676137647685994
Sun2251                 6.15        Tonya Carter  4832732618637221
...                      ...                 ...               ...
Sat2657                 9.68       Michael Avila  5296068606052842
Sat1766                13.59      Monica Sanders  3506806155565404
Sat3880                11.34          Keith Wong  6011891618747196
Sat17                   8.91        Dennis Dixon     4375220550950
Thur672                 9.39     Michelle Hardin  3511451626698139

[244 rows x 10 columns]

In [168]:
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [170]:
df.iloc[0:4]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994

In [169]:
df.loc['Sun2959']

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [174]:
df.loc[['Sun2959','Sun4608','Sun4458','Sun5260']]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994

In [175]:
df.drop('Sun2959')

  Male     No   Sat  Dinner     2
Thur672          18.78  3.00  Female     No  Thur  Dinner     2

            price_per_person        Payer Name         CC Number
Payment ID
Sun4608                 3.45    Douglas Tucker  4478071379779230
Sun4458                 7.00    Travis Walters  6011812112971322
Sun5260                11.84  Nathaniel Harris  4676137647685994
Sun2251                 6.15      Tonya Carter  4832732618637221
Sun9679                 6.32        Erik Smith   213140353657882
...                      ...               ...               ...
Sat2657                 9.68     Michael Avila  5296068606052842
Sat1766                13.59    Monica Sanders  3506806155565404
Sat3880                11.34        Keith Wong  6011891618747196
Sat17                   8.91      Dennis Dixon     4375220550950
Thur672                 9.39   Michelle Hardin  3511451626698139

[243 rows x 10 columns]

In [176]:
df

r     2
Thur672          18.78  3.00  Female     No  Thur  Dinner     2

            price_per_person          Payer Name         CC Number
Payment ID
Sun2959                 8.49  Christy Cunningham  3560325168603410
Sun4608                 3.45      Douglas Tucker  4478071379779230
Sun4458                 7.00      Travis Walters  6011812112971322
Sun5260                11.84    Nathaniel Harris  4676137647685994
Sun2251                 6.15        Tonya Carter  4832732618637221
...                      ...                 ...               ...
Sat2657                 9.68       Michael Avila  5296068606052842
Sat1766                13.59      Monica Sanders  3506806155565404
Sat3880                11.34          Keith Wong  6011891618747196
Sat17                   8.91        Dennis Dixon     4375220550950
Thur672                 9.39     Michelle Hardin  3511451626698139

[244 rows x 10 columns]

In [177]:
df = df.drop('Sun2959')

In [178]:
df

  Male     No   Sat  Dinner     2
Thur672          18.78  3.00  Female     No  Thur  Dinner     2

            price_per_person        Payer Name         CC Number
Payment ID
Sun4608                 3.45    Douglas Tucker  4478071379779230
Sun4458                 7.00    Travis Walters  6011812112971322
Sun5260                11.84  Nathaniel Harris  4676137647685994
Sun2251                 6.15      Tonya Carter  4832732618637221
Sun9679                 6.32        Erik Smith   213140353657882
...                      ...               ...               ...
Sat2657                 9.68     Michael Avila  5296068606052842
Sat1766                13.59    Monica Sanders  3506806155565404
Sat3880                11.34        Keith Wong  6011891618747196
Sat17                   8.91      Dennis Dixon     4375220550950
Thur672                 9.39   Michelle Hardin  3511451626698139

[243 rows x 10 columns]

In [180]:
add_row = df.iloc[0]

In [181]:
df = df.append(add_row)

In [182]:
df

Female     No  Thur  Dinner     2
Sun4608          10.34  1.66    Male     No   Sun  Dinner     3

            price_per_person        Payer Name         CC Number
Payment ID
Sun4608                 3.45    Douglas Tucker  4478071379779230
Sun4458                 7.00    Travis Walters  6011812112971322
Sun5260                11.84  Nathaniel Harris  4676137647685994
Sun2251                 6.15      Tonya Carter  4832732618637221
Sun9679                 6.32        Erik Smith   213140353657882
...                      ...               ...               ...
Sat1766                13.59    Monica Sanders  3506806155565404
Sat3880                11.34        Keith Wong  6011891618747196
Sat17                   8.91      Dennis Dixon     4375220550950
Thur672                 9.39   Michelle Hardin  3511451626698139
Sun4608                 3.45    Douglas Tucker  4478071379779230

[244 rows x 10 columns]

In [3]:
#adds at the end of last row
import numpy as np
import pandas as pd
#pwd()

In [4]:
#conditional filtering

df = pd.read_csv('c:\\Users\\saikiran\\Desktop\\py\\UDEMY_RESOURCES\\03-Pandas\\tips.csv')

In [12]:
df

240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17
243     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [32]:
bool_series = df['total_bill'] > 40
bool_series

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: total_bill, Length: 244, dtype: bool

In [33]:
df[bool_series]

inner     6              8.03
170       50.81  10.00    Male    Yes   Sat  Dinner     3             16.94
182       45.35   3.50    Male    Yes   Sun  Dinner     3             15.12
184       40.55   3.00    Male    Yes   Sun  Dinner     2             20.27
197       43.11   5.00  Female    Yes  Thur   Lunch     4             10.78
212       48.33   9.00    Male     No   Sat  Dinner     4             12.08

          Payer Name         CC Number Payment ID
59       Brian Ortiz  6596453823950595    Sat8139
95     Aaron Bentley   180026611638690    Fri9628
102    Heather Cohen   379771118886604    Sat6240
142     Eric Andrews  4356531761046453   Thur3621
156    Ryan Gonzales  3523151482063321    Sun7518
170    Gregory Clark  5473850968388236    Sat1954
182     Jose Parsons  4112207559459910    Sun2337
184      Stephen Cox  3547798222044029    Sun5140
197      Brooke Soto  5544902205760175   Thur9313
212  Alex Williamson      676218815212    Sat4590

In [35]:
df[df['total_bill'] > 40]

inner     6              8.03
170       50.81  10.00    Male    Yes   Sat  Dinner     3             16.94
182       45.35   3.50    Male    Yes   Sun  Dinner     3             15.12
184       40.55   3.00    Male    Yes   Sun  Dinner     2             20.27
197       43.11   5.00  Female    Yes  Thur   Lunch     4             10.78
212       48.33   9.00    Male     No   Sat  Dinner     4             12.08

          Payer Name         CC Number Payment ID
59       Brian Ortiz  6596453823950595    Sat8139
95     Aaron Bentley   180026611638690    Fri9628
102    Heather Cohen   379771118886604    Sat6240
142     Eric Andrews  4356531761046453   Thur3621
156    Ryan Gonzales  3523151482063321    Sun7518
170    Gregory Clark  5473850968388236    Sat1954
182     Jose Parsons  4112207559459910    Sun2337
184      Stephen Cox  3547798222044029    Sun5140
197      Brooke Soto  5544902205760175   Thur9313
212  Alex Williamson      676218815212    Sat4590

In [36]:
df[df['sex'] == 'Male']

       6.30
237       32.83  1.17  Male    Yes  Sat  Dinner     2             16.42
239       29.03  5.92  Male     No  Sat  Dinner     3              9.68
241       22.67  2.00  Male    Yes  Sat  Dinner     2             11.34
242       17.82  1.75  Male     No  Sat  Dinner     2              8.91

             Payer Name         CC Number Payment ID
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
5            Erik Smith   213140353657882    Sun9679
6    Kristopher Johnson  2223727524230344    Sun5985
..                  ...               ...        ...
236       Matthew Myers  3543676378973965    Sat5032
237        Thomas Brown  4284722681265508    Sat2929
239       Michael Avila  5296068606052842    Sat2657
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17

[157 rows x 11 columns]

In [37]:
df[df['size'] > 2]

 No  Sat  Dinner     4              5.11
230       24.01  2.00    Male    Yes  Sat  Dinner     4              6.00
231       15.69  3.00    Male    Yes  Sat  Dinner     3              5.23
238       35.83  4.67  Female     No  Sat  Dinner     3             11.94
239       29.03  5.92    Male     No  Sat  Dinner     3              9.68

          Payer Name         CC Number Payment ID
1     Douglas Tucker  4478071379779230    Sun4608
2     Travis Walters  6011812112971322    Sun4458
4       Tonya Carter  4832732618637221    Sun2251
5         Erik Smith   213140353657882    Sun9679
7        Robert Buck  3514785077705092    Sun8157
..               ...               ...        ...
227   Robert Bradley   213141668145910    Sat4319
230  Michael Osborne     4258682154026    Sat7872
231      Jason Parks     4812333796161    Sat6334
238   Kimberly Crane      676184013727    Sat9777
239    Michael Avila  5296068606052842    Sat2657

[84 rows x 11 columns]

In [40]:
df['day'] == 'Sun'

0       True
1       True
2       True
3       True
4       True
       ...
239    False
240    False
241    False
242    False
243    False
Name: day, Length: 244, dtype: bool

In [45]:
#multiple conditions
# and & or | 
df[(df['size'] == 2) & (df['day'] == 'Sun')]

 Sun8746
150           Luke Rice  4813617017359506    Sun8863
151        Jason Arnold  3571825125296106    Sun2127
158         Ashley Boyd  3571088058115021     Sun982
161     Brandon Oconnor  4406882156920533    Sun5879
163      Charles Newton  5552793481414044    Sun8594
164      Audrey Griffin  3500853929693258     Sun444
166         Gordon Lane  4110599849536479    Sun6738
172         Larry White    30432617123103    Sun9209
173         Scott Perez  3577115550328507    Sun9335
174         Brian Miles  3586342145399277    Sun7621
175     Nathan Reynolds   370307040837149    Sun5109
176      Walter Simmons  6011481578696110    Sun5961
177         John Dudley  4565183162071073    Sun6203
178        Melanie Gray     4211808859168    Sun4598
179        Brian Bailey   346656312114848    Sun9851
181           Jason Cox  6556931703586223    Sun3402
184         Stephen Cox  3547798222044029    Sun5140
190        Riley Barnes   180053549128800    Sun5104

In [6]:
df[(df['day'] == 'Fri') | (df['day'] == 'Sat') | (df['day'] == 'Sun')]

.94
239       29.03  5.92    Male     No  Sat  Dinner     3              9.68
240       27.18  2.00  Female    Yes  Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes  Sat  Dinner     2             11.34
242       17.82  1.75    Male     No  Sat  Dinner     2              8.91

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
238      Kimberly Crane      676184013727    Sat9777
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17

[182 rows x 11 columns]

In [7]:
#simple one

df[df['day'].isin(['Fri','Sat','Sun'])]

.94
239       29.03  5.92    Male     No  Sat  Dinner     3              9.68
240       27.18  2.00  Female    Yes  Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes  Sat  Dinner     2             11.34
242       17.82  1.75    Male     No  Sat  Dinner     2              8.91

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
238      Kimberly Crane      676184013727    Sat9777
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17

[182 rows x 11 columns]

In [8]:
#conditional filter .apply() to grab last four digits of cc number
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [9]:
#cc number is int type
#define coustum function and apply it to columns
1234567[-4:]

TypeError: 'int' object is not subscriptable

In [10]:
str(1234567)[-4:]

'4567'

In [11]:
def last_four(num):
    return str(num)[-4:]

In [12]:
last_four(365892)

'5892'

In [15]:
df['last_four'] = df['CC Number'].apply(last_four)
df

Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID last_four
0    Christy Cunningham  3560325168603410    Sun2959      3410
1        Douglas Tucker  4478071379779230    Sun4608      9230
2        Travis Walters  6011812112971322    Sun4458      1322
3      Nathaniel Harris  4676137647685994    Sun5260      5994
4          Tonya Carter  4832732618637221    Sun2251      7221
..                  ...               ...        ...       ...
239       Michael Avila  5296068606052842    Sat2657      2842
240      Monica Sanders  3506806155565404    Sat1766      5404
241          Keith Wong  6011891618747196    Sat3880      7196
242        Dennis Dixon     4375220550950      Sat17      0950
243     Michelle Hardin  3511451626698139    Thur672      8139

[244 rows x 12 columns]

In [16]:
#How pricy money = $$$
df['total_bill'].mean()

19.78594262295082

In [17]:
def price_in_dollers(price):
    if price < 10:
        return '$'
    elif price >= 10 and price < 30:
        return '$$'
    else:
        return '$$$'

In [18]:
price_in_dollers(100)

'$$$'

In [20]:
df['costly'] = df['total_bill'].apply([price_in_dollers])

In [21]:
df

inner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID last_four costly
0    Christy Cunningham  3560325168603410    Sun2959      3410     $$
1        Douglas Tucker  4478071379779230    Sun4608      9230     $$
2        Travis Walters  6011812112971322    Sun4458      1322     $$
3      Nathaniel Harris  4676137647685994    Sun5260      5994     $$
4          Tonya Carter  4832732618637221    Sun2251      7221     $$
..                  ...               ...        ...       ...    ...
239       Michael Avila  5296068606052842    Sat2657      2842     $$
240      Monica Sanders  3506806155565404    Sat1766      5404     $$
241          Keith Wong  6011891618747196    Sat3880      7196     $$
242        Dennis Dixon     4375220550950      Sat17      0950     $$
243     Michelle Hardin  3511451626698139    Thur672      8139     $$

[244 rows x 13 columns]

In [23]:
#appling apply() to multiple columns
sq = lambda num: num*2

In [24]:
sq(55)

110

In [25]:
df['totalbills_twice'] = df['total_bill'].apply(sq)
#or

In [ ]:
df['totalbills_twice'] = df['total_bill'].apply(lambda num: num*2)

In [26]:
df

  Sun4608      9230     $$
2        Travis Walters  6011812112971322    Sun4458      1322     $$
3      Nathaniel Harris  4676137647685994    Sun5260      5994     $$
4          Tonya Carter  4832732618637221    Sun2251      7221     $$
..                  ...               ...        ...       ...    ...
239       Michael Avila  5296068606052842    Sat2657      2842     $$
240      Monica Sanders  3506806155565404    Sat1766      5404     $$
241          Keith Wong  6011891618747196    Sat3880      7196     $$
242        Dennis Dixon     4375220550950      Sat17      0950     $$
243     Michelle Hardin  3511451626698139    Thur672      8139     $$

     totalbills_twice
0               33.98
1               20.68
2               42.02
3               47.36
4               49.18
..                ...
239             58.06
240             54.36
241             45.34
242             35.64
243             37.56

[244 rows x 14 columns]

In [65]:
#appling apply() to multiple columns total bill and tip
def quality(total_bill, tip):
    if tip/total_bill < 0.25:
        return "Good"
    elif tip/total_bill <= 0.5 and tip/total_bill > 0.25:
        return "better"
    else:
        return "best"

In [66]:
quality(100, 60)

'best'

In [67]:
#applying lambda
df['tips_quality'] = df[['total_bill', 'tip']].apply(lambda df: quality(df['total_bill'], df['tip']), axis =1)
df

550950      Sat17      0950     $$
243     Michelle Hardin  3511451626698139    Thur672      8139     $$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
0               33.98         Good          16.821782        0.059447
1               20.68         Good           6.228916        0.160542
2               42.02         Good           6.002857        0.166587
3               47.36         Good           7.154079        0.139780
4               49.18         Good           6.811634        0.146808
..                ...          ...                ...             ...
239             58.06         Good           4.903716        0.203927
240             54.36         Good          13.590000        0.073584
241             45.34         Good          11.335000        0.088222
242             35.64         Good          10.182857        0.098204
243             37.56         Good           6.260000        0.159744

[244 rows x 17 columns]

In [45]:
#simpleone and faster one
import numpy as np
df['tips_quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])

In [46]:
df

     5994     $$
4          Tonya Carter  4832732618637221    Sun2251      7221     $$
..                  ...               ...        ...       ...    ...
239       Michael Avila  5296068606052842    Sat2657      2842     $$
240      Monica Sanders  3506806155565404    Sat1766      5404     $$
241          Keith Wong  6011891618747196    Sat3880      7196     $$
242        Dennis Dixon     4375220550950      Sat17      0950     $$
243     Michelle Hardin  3511451626698139    Thur672      8139     $$

     totalbills_twice tips_quality
0               33.98         Good
1               20.68         Good
2               42.02         Good
3               47.36         Good
4               49.18         Good
..                ...          ...
239             58.06         Good
240             54.36         Good
241             45.34         Good
242             35.64         Good
243             37.56         Good

[244 rows x 15 columns]

In [95]:
df['tips_quality'].value_counts()

Good      234
better      9
best        1
Name: tips_quality, dtype: int64

In [68]:
np.count_nonzero(df['tips_quality'] == 'Good')

234

In [69]:
np.count_nonzero(df['tips_quality'] == 'best')

1

In [70]:
np.count_nonzero(df['tips_quality'] == 'better')

9

In [72]:
df[df['tips_quality'] == 'better']

  Melanie Gray     4211808859168    Sun4598      9168      $
183  Dr. Michael James     4718501859162    Sun6059      9162     $$
221     Leslie Kaufman   379437981958785    Fri7511      8785     $$
232       James Taylor  6011482917327995    Sat2124      7995     $$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
51              20.58       better           3.957692        0.252672
67               6.14       better           3.070000        0.325733
93              32.64       better           3.795349        0.263480
109             28.62       better           3.577500        0.279525
149             15.02       better           3.755000        0.266312
178             19.20       better           2.400000        0.416667
183             46.34       better           3.564615        0.280535
221             26.84       better           3.856322        0.259314
232             23.22       better           3.424779        0.291990

In [71]:
df[df['tips_quality'] == 'best']

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,costly,totalbills_twice,tips_quality,total_bill_by_tip,tip_total_bill
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209,3103,$,14.5,best,1.407767,0.710345

In [58]:
#to cheak 
df['tip_total_bill'] = df['tip'] / df['total_bill']

In [59]:
df

550950      Sat17      0950     $$
243     Michelle Hardin  3511451626698139    Thur672      8139     $$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
0               33.98         Good          16.821782        0.059447
1               20.68         Good           6.228916        0.160542
2               42.02         Good           6.002857        0.166587
3               47.36         Good           7.154079        0.139780
4               49.18         Good           6.811634        0.146808
..                ...          ...                ...             ...
239             58.06         Good           4.903716        0.203927
240             54.36         Good          13.590000        0.073584
241             45.34         Good          11.335000        0.088222
242             35.64         Good          10.182857        0.098204
243             37.56         Good           6.260000        0.159744

[244 rows x 17 columns]

In [64]:
df[df['tips_quality'] == 'best']

 Michael James     4718501859162    Sun6059      9162     $$
221     Leslie Kaufman   379437981958785    Fri7511      8785     $$
232       James Taylor  6011482917327995    Sat2124      7995     $$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
51              20.58         best           3.957692        0.252672
67               6.14         best           3.070000        0.325733
93              32.64         best           3.795349        0.263480
109             28.62         best           3.577500        0.279525
149             15.02         best           3.755000        0.266312
172             14.50         best           1.407767        0.710345
178             19.20         best           2.400000        0.416667
183             46.34         best           3.564615        0.280535
221             26.84         best           3.856322        0.259314
232             23.22         best           3.424779        0.291990

In [73]:
df

550950      Sat17      0950     $$
243     Michelle Hardin  3511451626698139    Thur672      8139     $$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
0               33.98         Good          16.821782        0.059447
1               20.68         Good           6.228916        0.160542
2               42.02         Good           6.002857        0.166587
3               47.36         Good           7.154079        0.139780
4               49.18         Good           6.811634        0.146808
..                ...          ...                ...             ...
239             58.06         Good           4.903716        0.203927
240             54.36         Good          13.590000        0.073584
241             45.34         Good          11.335000        0.088222
242             35.64         Good          10.182857        0.098204
243             37.56         Good           6.260000        0.159744

[244 rows x 17 columns]

In [76]:
df.describe().transpose()

e+00  2.914234e+00  2.880000e+00
CC Number          244.0  2.563496e+15  2.369340e+15  6.040679e+10
totalbills_twice   244.0  3.957189e+01  1.780482e+01  6.140000e+00
total_bill_by_tip  244.0  7.048932e+00  2.905234e+00  1.407767e+00
tip_total_bill     244.0  1.608026e-01  6.107220e-02  3.563814e-02

                            25%           50%           75%           max
total_bill         1.334750e+01  1.779500e+01  2.412750e+01  5.081000e+01
tip                2.000000e+00  2.900000e+00  3.562500e+00  1.000000e+01
size               2.000000e+00  2.000000e+00  3.000000e+00  6.000000e+00
price_per_person   5.800000e+00  7.255000e+00  9.390000e+00  2.027000e+01
CC Number          3.040731e+13  3.525318e+15  4.553675e+15  6.596454e+15
totalbills_twice   2.669500e+01  3.559000e+01  4.825500e+01  1.016200e+02
total_bill_by_tip  5.222632e+00  6.461264e+00  7.744413e+00  2.805983e+01
tip_total_bill     1.291274e-01  1.547698e-01  1.914755e-01  7.103448e-01

In [77]:
df.sort_values('tip')
# df.sort_values('tip' ascending=False)

815212    Sat4590      5212    $$$
170       Gregory Clark  5473850968388236    Sat1954      8236    $$$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
67               6.14       better           3.070000        0.325733
236             25.20         Good          12.600000        0.079365
92              11.50         Good           5.750000        0.173913
111             14.50         Good           7.250000        0.137931
0               33.98         Good          16.821782        0.059447
..                ...          ...                ...             ...
141             68.60         Good           5.119403        0.195335
59              96.54         Good           7.172363        0.139424
23              78.84         Good           5.200528        0.192288
212             96.66         Good           5.370000        0.186220
170            101.62         Good           5.081000        0.196812

[244 rows x 17 columns]

In [79]:
df.sort_values('tip',ascending=False)

995267    Sat3455      5267      $
92         Leah Ramirez  3508911676966392    Fri3780      6392      $

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
170            101.62         Good           5.081000        0.196812
212             96.66         Good           5.370000        0.186220
23              78.84         Good           5.200528        0.192288
59              96.54         Good           7.172363        0.139424
141             68.60         Good           5.119403        0.195335
..                ...          ...                ...             ...
0               33.98         Good          16.821782        0.059447
236             25.20         Good          12.600000        0.079365
111             14.50         Good           7.250000        0.137931
67               6.14       better           3.070000        0.325733
92              11.50         Good           5.750000        0.173913

[244 rows x 17 columns]

In [82]:
df.sort_values(['tip','size'])

815212    Sat4590      5212    $$$
170       Gregory Clark  5473850968388236    Sat1954      8236    $$$

     totalbills_twice tips_quality  total_bill_by_tip  tip_total_bill
67               6.14       better           3.070000        0.325733
111             14.50         Good           7.250000        0.137931
92              11.50         Good           5.750000        0.173913
236             25.20         Good          12.600000        0.079365
0               33.98         Good          16.821782        0.059447
..                ...          ...                ...             ...
141             68.60         Good           5.119403        0.195335
59              96.54         Good           7.172363        0.139424
23              78.84         Good           5.200528        0.192288
212             96.66         Good           5.370000        0.186220
170            101.62         Good           5.081000        0.196812

[244 rows x 17 columns]

In [84]:
df['total_bill'].max()

50.81

In [86]:
df['total_bill'].idxmax()

170

In [87]:
df.iloc[170]
#df.iloc[df['total_bill'].idxmax()]

total_bill                      50.81
tip                                10
sex                              Male
smoker                            Yes
day                               Sat
time                           Dinner
size                                3
price_per_person                16.94
Payer Name              Gregory Clark
CC Number            5473850968388236
Payment ID                    Sat1954
last_four                        8236
costly                            $$$
totalbills_twice               101.62
tips_quality                     Good
total_bill_by_tip               5.081
tip_total_bill               0.196812
Name: 170, dtype: object

In [88]:
df.iloc[df['total_bill'].idxmin()]

total_bill                       3.07
tip                                 1
sex                            Female
smoker                            Yes
day                               Sat
time                           Dinner
size                                1
price_per_person                 3.07
Payer Name              Tiffany Brock
CC Number            4359488526995267
Payment ID                    Sat3455
last_four                        5267
costly                              $
totalbills_twice                 6.14
tips_quality                   better
total_bill_by_tip                3.07
tip_total_bill               0.325733
Name: 67, dtype: object

In [89]:
df.corr()
#ony for integer

,total_bill,tip,size,price_per_person,CC Number,totalbills_twice,total_bill_by_tip,tip_total_bill
total_bill,1.000000,0.675734,0.598315,0.647554,0.104576,1.000000,0.380516,-0.338624
tip,0.675734,1.000000,0.489299,0.347405,0.110857,0.675734,-0.336901,0.342370
size,0.598315,0.489299,1.000000,-0.175359,-0.030239,0.598315,0.106497,-0.142860
price_per_person,0.647554,0.347405,-0.175359,1.000000,0.135240,0.647554,0.397457,-0.314238
CC Number,0.104576,0.110857,-0.030239,0.135240,1.000000,0.104576,-0.005077,-0.032384
totalbills_twice,1.000000,0.675734,0.598315,0.647554,0.104576,1.000000,0.380516,-0.338624
total_bill_by_tip,0.380516,-0.336901,0.106497,0.397457,-0.005077,0.380516,1.000000,-0.755433
tip_total_bill,-0.338624,0.342370,-0.142860,-0.314238,-0.032384,-0.338624,-0.755433,1.000000

In [90]:
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [5]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [6]:
len(df['day'].unique())

4

In [7]:
df['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [2]:
import pandas as pd
df = pd.read_csv('c:\\Users\\saikiran\\Desktop\\py\\UDEMY_RESOURCES\\03-Pandas\\tips.csv')

In [20]:
#replace and mapping
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [11]:
df['sex'].replace('Female', 'F')

0         F
1      Male
2      Male
3      Male
4         F
       ...
239    Male
240       F
241    Male
242    Male
243       F
Name: sex, Length: 244, dtype: object

In [21]:
df['sex'].replace(['Female','Male'] ,['F','M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [26]:
mymap = {'Female':'F','Male':'M'}

In [28]:
df['sex'].map(mymap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [17]:
df

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [22]:
df

240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17
243     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [29]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [31]:
simple_df = pd.DataFrame([1,2,3,4,4,4],['a','b','c','d','e','f'])

In [32]:
simple_df

   0
a  1
b  2
c  3
d  4
e  4
f  4

In [33]:
simple_df.duplicated()

a    False
b    False
c    False
d    False
e     True
f     True
dtype: bool

In [35]:
simple_df.drop_duplicates()

   0
a  1
b  2
c  3
d  4

In [37]:
df['total_bill'].between(10,20,inclusive=True)

0       True
1       True
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242     True
243     True
Name: total_bill, Length: 244, dtype: bool

In [38]:
df[df['total_bill'].between(10,20,inclusive=True)]

235       10.07  1.25    Male     No   Sat  Dinner     2              5.04
236       12.60  1.00    Male    Yes   Sat  Dinner     2              6.30
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
8       Joseph Mcdonald  3522866365840377    Sun6820
9         Jerome Abbott  3532124519049786    Sun3775
10        William Riley      566287581219    Sun2546
..                  ...               ...        ...
234       Tracy Douglas  4097938155941930    Sat7220
235       Sean Gonzalez  3534021246117605    Sat4615
236       Matthew Myers  3543676378973965    Sat5032
242        Dennis Dixon     4375220550950      Sat17
243     Michelle Hardin  3511451626698139    Thur672

[130 rows x 11 columns]

In [39]:
df.nlargest(10,'tip')
#first n largest tips

   5.72
183       23.17   6.50    Male    Yes   Sun  Dinner     4              5.79
214       28.17   6.50  Female    Yes   Sat  Dinner     3              9.39
47        32.40   6.00    Male     No   Sun  Dinner     4              8.10
239       29.03   5.92    Male     No   Sat  Dinner     3              9.68
88        24.71   5.85    Male     No  Thur   Lunch     2             12.36

            Payer Name         CC Number Payment ID
170      Gregory Clark  5473850968388236    Sat1954
212    Alex Williamson      676218815212    Sat4590
23      Lance Peterson  3542584061609808     Sat239
59         Brian Ortiz  6596453823950595    Sat8139
141     Steven Carlson  3526515703718508   Thur1025
183  Dr. Michael James     4718501859162    Sun6059
214    Marissa Jackson  4922302538691962    Sat3374
47        James Barnes  3552002592874186    Sun9677
239      Michael Avila  5296068606052842    Sat2657
88        Roger Taylor     4410248629955   Thur9003

In [42]:
df.sort_values('tip',ascending=False).iloc[0:5]
#same as above

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025

In [43]:
df.nsmallest(10,'tip')

9
215       12.90  1.10  Female    Yes   Sat  Dinner     2              6.45
237       32.83  1.17    Male    Yes   Sat  Dinner     2             16.42
75        10.51  1.25    Male     No   Sat  Dinner     2              5.26
135        8.51  1.25  Female     No  Thur   Lunch     2              4.26
235       10.07  1.25    Male     No   Sat  Dinner     2              5.04

             Payer Name         CC Number Payment ID
67        Tiffany Brock  4359488526995267    Sat3455
92         Leah Ramirez  3508911676966392    Fri3780
111         Terri Jones  3559221007826887    Sat4801
236       Matthew Myers  3543676378973965    Sat5032
0    Christy Cunningham  3560325168603410    Sun2959
215        Jessica Owen     4726904879471    Sat6983
237        Thomas Brown  4284722681265508    Sat2929
75        Kenneth Hayes   213142079731108    Sat5056
135      Rebecca Harris  4320272020376174   Thur6600
235       Sean Gonzalez  3534021246117605    Sat4615

In [4]:
df.sample(5)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
114,25.71,4.00,Female,No,Sun,Dinner,3,8.57,Katie Smith,5400160161311292,Sun6492
109,14.31,4.00,Female,Yes,Sat,Dinner,2,7.16,Amanda Anderson,375638820334211,Sat2614
66,16.45,2.47,Female,No,Sat,Dinner,2,8.22,Rachel Vaughn,3569262692675583,Sat4750
227,20.45,3.00,Male,No,Sat,Dinner,4,5.11,Robert Bradley,213141668145910,Sat4319
194,16.58,4.00,Male,Yes,Thur,Lunch,2,8.29,Benjamin Weber,676210011505,Thur9318

In [5]:
df.sample(frac=0.1)

  Sun591
43   Christopher Spears  4387671121369212    Sun3279
160     Travis Gonzalez  3527668419764685     Sun245
161     Brandon Oconnor  4406882156920533    Sun5879
47         James Barnes  3552002592874186    Sun9677
159    Christopher Soto    30501814271434    Sun1781
202         Ashley Shaw   180088043008041   Thur1301
186      Heidi Atkinson  4422858423131187    Sun4254
64      Michael Johnson  2222114458088108    Sat1667
13         Joshua Jones  6011163105616890    Sun2971
101       Tiffany Colon  6011012799432041    Fri8382
194      Benjamin Weber      676210011505   Thur9318
214     Marissa Jackson  4922302538691962    Sat3374
237        Thomas Brown  4284722681265508    Sat2929
33        Amber Francis   377742985258914    Sat6649
132     Taylor Gonzalez  6011990685390011   Thur7783
8       Joseph Mcdonald  3522866365840377    Sun6820
128   Christine Perkins  3548391118913991   Thur8551
176      Walter Simmons  6011481578696110    Sun5961

In [5]:
#missing data
#ml and stats models cannt deal with missing data
# keep it, remove it, replace it
import numpy as np
import pandas as pd
df = pd.read_csv('C:\\Users\\saikiran\\Desktop\\py\\UDEMY_RESOURCES\\DATA\\tips.csv')

In [6]:
df

240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID
0    Christy Cunningham  3560325168603410    Sun2959
1        Douglas Tucker  4478071379779230    Sun4608
2        Travis Walters  6011812112971322    Sun4458
3      Nathaniel Harris  4676137647685994    Sun5260
4          Tonya Carter  4832732618637221    Sun2251
..                  ...               ...        ...
239       Michael Avila  5296068606052842    Sat2657
240      Monica Sanders  3506806155565404    Sat1766
241          Keith Wong  6011891618747196    Sat3880
242        Dennis Dixon     4375220550950      Sat17
243     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [7]:
np.nan

nan

In [8]:
pd.NaT

NaT

In [9]:
np.nan == np.nan

False

In [10]:
#missing value not equals to missing value
np.nan is np.nan

True

In [11]:
var = np.nan

In [12]:
var is np.nan

True

In [15]:
import numpy as np
import pandas as pd
df = pd.read_csv('C:\\Users\\saikiran\\Desktop\\py\\UDEMY_RESOURCES\\DATA\\movie_scores.csv')

In [4]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [16]:
df.tail(4)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [18]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [19]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [26]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [27]:
df[df['pre_movie_score'].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [33]:
df[(df['pre_movie_score'].isnull()) & (df['first_name'].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [34]:
#keep data
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [37]:
#drop data
help(df.dropna)

940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'born'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [5]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [16]:
df.dropna(thresh=1)
#dont drop rows which atleast one non nan values

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [17]:
df.dropna(thresh=2)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [11]:
df.dropna(thresh=3)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [12]:
df.dropna(thresh=4)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [18]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [8]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [7]:
df.dropna(axis=1)
#since all columns have nan

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [19]:
df.dropna(thresh=4,axis=1)

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

In [20]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [21]:
df.fillna("NEW VALUE!")

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63,m,8,10
1,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!
2,Hugh,Jackman,51,m,NEW VALUE!,NEW VALUE!
3,Oprah,Winfrey,66,f,6,8
4,Emma,Stone,31,f,7,9

In [22]:
df['first_name'].fillna("Empty")

0      Tom
1    Empty
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [23]:
df['first_name'] = df['first_name'].fillna("Empty")

In [24]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1      Empty       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [25]:
df['pre_movie_score'].mean()

7.0

In [26]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [27]:
df.fillna(df.mean())

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1      Empty       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

In [28]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [29]:
ser = pd.Series(airline_tix)

In [30]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [31]:
ser.interpolate()
#interpol b/w top and bottom of nan

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

In [32]:
df = pd.DataFrame(ser,columns=['Price'])

In [34]:
df

              Price
first         100.0
business        NaN
economy-plus   50.0
economy        30.0

In [33]:
df.interpolate()

              Price
first         100.0
business       75.0
economy-plus   50.0
economy        30.0

In [37]:
df = df.reset_index()

In [40]:
df = df.interpolate(method='spline',order=2)
df

          index       Price
0         first  100.000000
1      business   73.333333
2  economy-plus   50.000000
3       economy   30.000000